Car/More Than Smart Wheels/xml/MSW3_21082014_1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Quote xmlns="http://TGSL/TES_Aggregator">
      <lxmlTGSLXML>
        <tgsl xmlns="http://www.transactorgsl.com/schemas">
          <aggregator>comparethemarket</aggregator>
          <domain>http://localhost</domain>
          <partner>
            <partnerName>trak</partnerName>
            <broker>morethan</broker>
          </partner>
          <product>motor</product>
        </tgsl>
      </lxmlTGSLXML>
      <lstrRiskXML>
        <p:motorRisk xmlns:p="http://www.transactorgsl.com/schemas" xmlns="http://www.transactorgsl.com/schemas">
          <p:insuredParty instance="1">
            <p:accessToOtherVehicles>false</p:accessToOtherVehicles>
            <p:client>true</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2010-09-10T00:00:00</p:dateLicenceObtained>
            <p:dob>1992-04-26T00:00:00</p:dob>
            <p:email>stuart.scott@comparethemarket.com</p:email>
            <p:forename>Angelina</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>F</p:licenceTypeID>
            <p:mainDriver>true</p:mainDriver>
            <p:maritalStatusID>S</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:numberOfVehiclesAccessTo>1</p:numberOfVehiclesAccessTo>
            <p:password>compareDM</p:password>
            <p:sex>F</p:sex>
            <p:surname>Jolie</p:surname>
            <p:titleID>002</p:titleID>
            <p:ukResidenceYears>22</p:ukResidenceYears>
            <p:vehicleUseID>01</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:insuredParty instance="2">
            <p:accessToOtherVehicles>true</p:accessToOtherVehicles>
            <p:client>false</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2010-09-10T00:00:00</p:dateLicenceObtained>
            <p:dob>1970-01-26T00:00:00</p:dob>
            <p:email />
            <p:forename>Brad</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>F</p:licenceTypeID>
            <p:mainDriver>false</p:mainDriver>
            <p:maritalStatusID>M</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:relationshipID>U</p:relationshipID>
            <p:password>compareDM</p:password>
            <p:sex>M</p:sex>
            <p:surname>Pitt</p:surname>
            <p:titleID>003</p:titleID>
            <p:ukResidenceYears>44</p:ukResidenceYears>
            <p:vehicleUseID>01</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:correspondanceAddress instance="1">
            <p:city>Milton Keynes</p:city>
            <p:country />
            <p:county>Buckinghamshire</p:county>
            <p:house>178</p:house>
            <p:locality />
            <p:postcode>MK9 3AY</p:postcode>
            <p:street>North Tenth Street</p:street>
          </p:correspondanceAddress>
          <p:occupation instance="1" insuredPartyInstance="1">
            <p:employersBusinessID>323</p:employersBusinessID>
            <p:employmentStatusID>E</p:employmentStatusID>
            <p:occupationID>T03</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:occupation instance="1" insuredPartyInstance="2">
            <p:employersBusinessID>323</p:employersBusinessID>
            <p:employmentStatusID>E</p:employmentStatusID>
            <p:occupationID>T03</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:telephone instance="1">
            <p:telephoneNumber>01010010101</p:telephoneNumber>
            <p:telephoneTypeID>3AJPQ7C4</p:telephoneTypeID>
          </p:telephone>
          <p:cover instance="1">
            <p:coverRequiredID>01</p:coverRequiredID>
            <p:coverStartDate>2014-09-10T00:00:00</p:coverStartDate>
            <p:previousInsurance>true</p:previousInsurance>
            <p:previousInsuranceExpiryDate>2014-09-10T00:00:00</p:previousInsuranceExpiryDate>
            <p:previousInsurancePolicyNumber>1</p:previousInsurancePolicyNumber>
            <p:previousInsurerID>999</p:previousInsurerID>
            <p:voluntaryExcess>450</p:voluntaryExcess>
          </p:cover>
          <p:vehicle instance="1">
            <p:abiCode>52068801</p:abiCode>
            <p:annualMileage>9000</p:annualMileage>
            <p:bodyTypeID>03</p:bodyTypeID>
            <p:businessMileage>0</p:businessMileage>
            <p:currentMileage>0</p:currentMileage>
            <p:dateOfPurchase>2011-11-01T00:00:00</p:dateOfPurchase>
            <p:fuelTypeID>001</p:fuelTypeID>
            <p:gearboxTypeID>002</p:gearboxTypeID>
            <p:imported>false</p:imported>
            <p:increasedBHP>0</p:increasedBHP>
            <p:keeperID>1</p:keeperID>
            <p:kitCar>false</p:kitCar>
            <p:leftHandDrive>false</p:leftHandDrive>
            <p:modifiedWhilstOwned>false</p:modifiedWhilstOwned>
            <p:numberOfDoors>5</p:numberOfDoors>
            <p:numberOfSeats>7</p:numberOfSeats>
            <p:ownerID>1</p:ownerID>
            <p:overnightParkingID>4</p:overnightParkingID>
            <p:pricePaid>8512</p:pricePaid>
            <p:qPlated>false</p:qPlated>
            <p:registrationNumber>BN60 YNS</p:registrationNumber>
            <p:usedForTrackDays>false</p:usedForTrackDays>
            <p:value>8512</p:value>
            <p:vehicleCC>1910</p:vehicleCC>
            <p:vehicleMake>Vauxhall</p:vehicleMake>
            <p:vehicleModel>Zafira</p:vehicleModel>
            <p:yearOfManufacture>2010</p:yearOfManufacture>
          </p:vehicle>
          <p:ncd instance="1">
            <p:ncdYears>4</p:ncdYears>
            <p:protectedNCD>false</p:protectedNCD>
          </p:ncd>
          <p:garageAddress instance="1">
            <p:city>Milton Keynes</p:city>
            <p:country />
            <p:county>Buckinghamshire</p:county>
            <p:house>178</p:house>
            <p:locality />
            <p:postcode>MK9 3AY</p:postcode>
            <p:street>North Tenth Street</p:street>
          </p:garageAddress>
          <p:security instance="1">
            <p:dateFitted>2014-08-20T00:00:00</p:dateFitted>
            <p:fittedByID>4</p:fittedByID>
            <p:securityID>92</p:securityID>
          </p:security>
        </p:motorRisk>
      </lstrRiskXML>
    </Quote>
  </soap:Body>
</soap:Envelope>